In [3]:
import pandas as pd
import numpy as np
from mlxtend.preprocessing import TransactionEncoder
from mlxtend.frequent_patterns import apriori, association_rules

In [4]:
df = pd.read_csv('House_Rent.csv')

In [5]:
backup_df = df

In [6]:
df.head()

   BHK   Rent  Size Area Type  City  Furnishing Status  Bathroom
0    2  10000  1100         1     1                  1         2
1    2  20000   800         1     1                  2         1
2    2  17000  1000         1     1                  2         1
3    2  10000   800         1     1                  1         1
4    2   7500   850         2     1                  1         1

In [7]:
df.drop(['BHK', 'Rent','Size'], axis=1, inplace=True)

In [8]:
arr = df.to_numpy()
arr = np.transpose(arr)
arr = arr[1:]

In [9]:
# Encoding
tr = TransactionEncoder()
tr_arr = tr.fit(arr).transform(arr)
df = pd.DataFrame(tr_arr, columns = tr.columns_)
df.head()

     1     2      3      4      5      6      7      10
0  True  True   True   True   True   True  False  False
1  True  True  False  False  False  False  False  False
2  True  True   True   True   True   True   True   True

In [10]:
#Applying Apriori
from mlxtend.frequent_patterns import apriori
frequent_itemsets = apriori(df, min_support = 0.5, use_colnames = True)
frequent_itemsets.head()

    support itemsets
0  1.000000      (1)
1  1.000000      (2)
2  0.666667      (3)
3  0.666667      (4)
4  0.666667      (5)